app/Models/Functions.php

select * from `settings` where `settingId` = 1
---
    public static function settings() {
        $settings = DB::table('settings')->select('*')->where("settingId", 1)->get()->toArray();