app/Http/Controllers/Admin/PosController.php

        $data['comments'] = Functions::getDataWhere("comment_master", "storeId", Session::get('storeId'));
        $data['additionalCharges'] = Functions::getDataWhereOrderBy("additional_charges", "storeId", Session::get('storeId'), "sortOrder", "ASC");

        $data['customers'] = DB::table('customers')->where('storeId', Session::get('storeId'))->where('status', 1)->where('softDelete', 0)->whereDate('dateAdded', date('Y-m-d'))->count();
        $data['ordersCount'] = DB::table('order')->where('storeId', Session::get('storeId'))->where('softDelete', 0)->where('status', 1)->where('hold', 0)->whereDate('dateAdded', date('Y-m-d'))->count();
        $data['runningOrders'] = DB::table('order')->where('storeId', Session::get('storeId'))->where('softDelete', 0)->where('status', 1)->where('hold', 1)->where('hotel', 0)->whereDate('dateAdded', date('Y-m-d'))->count();
---
select count(*) as aggregate from `customers` where `storeId` = 1 and `status` = 1 and `softDelete` = 0 and date(`dateAdded`) = '2025-03-25'
SELECT globalDiscount,productDiscount FROM `order` WHERE storeId='1' AND softDelete='0' AND status='1' AND hold='0' AND date(dateAdded) = '2025-03-25'
select count(*) as aggregate from `order` where `storeId` = 1 and `softDelete` = 0 and `status` = 1 and `hold` = 0 and date(`dateAdded`) = '2025-03-25'
select count(*) as aggregate from `order` where `storeId` = 1 and `softDelete` = 0 and `status` = 1 and `hold` = 1 and `hotel` = 0 and date(`dateAdded`) = '2025-03-25'